MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1513/mcu.h
// Register: AADCON1
#define AADCON1 AADCON1
extern volatile unsigned char           AADCON1             __at(0x712);
#ifndef _LIB_BUILD
asm("AADCON1 equ 0712h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADPREF0                :1;
        unsigned ADPREF1                :1;
        unsigned                        :2;
        unsigned ADCS0                  :1;
        unsigned ADCS1                  :1;
        unsigned ADCS2                  :1;
        unsigned ADFM                   :1;
    };
    struct {
        unsigned ADPREF                 :2;
        unsigned                        :2;
        unsigned ADCS                   :3;
    };
} AADCON1bits_t;
extern volatile AADCON1bits_t AADCON1bits __at(0x712);
// bitfield macros
#define _AADCON1_ADPREF0_POSN                               0x0
#define _AADCON1_ADPREF0_POSITION                           0x0
#define _AADCON1_ADPREF0_SIZE                               0x1
#define _AADCON1_ADPREF0_LENGTH                             0x1
#define _AADCON1_ADPREF0_MASK                               0x1
#define _AADCON1_ADPREF1_POSN                               0x1
#define _AADCON1_ADPREF1_POSITION                           0x1
#define _AADCON1_ADPREF1_SIZE                               0x1
#define _AADCON1_ADPREF1_LENGTH                             0x1
#define _AADCON1_ADPREF1_MASK                               0x2
#define _AADCON1_ADCS0_POSN                                 0x4
#define _AADCON1_ADCS0_POSITION                             0x4
#define _AADCON1_ADCS0_SIZE                                 0x1
#define _AADCON1_ADCS0_LENGTH                               0x1
#define _AADCON1_ADCS0_MASK                                 0x10
#define _AADCON1_ADCS1_POSN                                 0x5
#define _AADCON1_ADCS1_POSITION                             0x5
#define _AADCON1_ADCS1_SIZE                                 0x1
#define _AADCON1_ADCS1_LENGTH                               0x1
#define _AADCON1_ADCS1_MASK                                 0x20
#define _AADCON1_ADCS2_POSN                                 0x6
#define _AADCON1_ADCS2_POSITION                             0x6
#define _AADCON1_ADCS2_SIZE                                 0x1
#define _AADCON1_ADCS2_LENGTH                               0x1
#define _AADCON1_ADCS2_MASK                                 0x40
#define _AADCON1_ADFM_POSN                                  0x7
#define _AADCON1_ADFM_POSITION                              0x7
#define _AADCON1_ADFM_SIZE                                  0x1
#define _AADCON1_ADFM_LENGTH                                0x1
#define _AADCON1_ADFM_MASK                                  0x80
#define _AADCON1_ADPREF_POSN                                0x0
#define _AADCON1_ADPREF_POSITION                            0x0
#define _AADCON1_ADPREF_SIZE                                0x2
#define _AADCON1_ADPREF_LENGTH                              0x2
#define _AADCON1_ADPREF_MASK                                0x3
#define _AADCON1_ADCS_POSN                                  0x4
#define _AADCON1_ADCS_POSITION                              0x4
#define _AADCON1_ADCS_SIZE                                  0x3
#define _AADCON1_ADCS_LENGTH                                0x3
#define _AADCON1_ADCS_MASK                                  0x70

// Register: AADCON2
#define AADCON2 AADCON2
extern volatile unsigned char           AADCON2             __at(0x713);
#ifndef _LIB_BUILD
asm("AADCON2 equ 0713h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :4;
        unsigned TRIGSEL0               :1;
        unsigned TRIGSEL1               :1;
        unsigned TRIGSEL2               :1;
    };
    struct {
        unsigned                        :4;
        unsigned TRIGSEL                :3;
    };
} AADCON2bits_t;
extern volatile AADCON2bits_t AADCON2bits __at(0x713);
// bitfield macros
#define _AADCON2_TRIGSEL0_POSN                              0x4
#define _AADCON2_TRIGSEL0_POSITION                          0x4
#define _AADCON2_TRIGSEL0_SIZE                              0x1
#define _AADCON2_TRIGSEL0_LENGTH                            0x1
#define _AADCON2_TRIGSEL0_MASK                              0x10
#define _AADCON2_TRIGSEL1_POSN                              0x5
#define _AADCON2_TRIGSEL1_POSITION                          0x5
#define _AADCON2_TRIGSEL1_SIZE                              0x1
#define _AADCON2_TRIGSEL1_LENGTH                            0x1
#define _AADCON2_TRIGSEL1_MASK                              0x20
#define _AADCON2_TRIGSEL2_POSN                              0x6
#define _AADCON2_TRIGSEL2_POSITION                          0x6
#define _AADCON2_TRIGSEL2_SIZE                              0x1
#define _AADCON2_TRIGSEL2_LENGTH                            0x1
#define _AADCON2_TRIGSEL2_MASK                              0x40
#define _AADCON2_TRIGSEL_POSN                               0x4
#define _AADCON2_TRIGSEL_POSITION                           0x4
#define _AADCON2_TRIGSEL_SIZE                               0x3
#define _AADCON2_TRIGSEL_LENGTH                             0x3
#define _AADCON2_TRIGSEL_MASK                               0x70

// Register: AADCON3
#define AADCON3 AADCON3
extern volatile unsigned char           AADCON3             __at(0x714);
#ifndef _LIB_BUILD
asm("AADCON3 equ 0714h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADDSEN                 :1;
        unsigned ADIPEN                 :1;
        unsigned                        :1;
        unsigned ADOOEN                 :1;
        unsigned ADOEN                  :1;
        unsigned ADOLEN                 :1;
        unsigned ADIPPOL                :1;
        unsigned ADEPPOL                :1;
    };
} AADCON3bits_t;
extern volatile AADCON3bits_t AADCON3bits __at(0x714);
// bitfield macros
#define _AADCON3_ADDSEN_POSN                                0x0
#define _AADCON3_ADDSEN_POSITION                            0x0
#define _AADCON3_ADDSEN_SIZE                                0x1
#define _AADCON3_ADDSEN_LENGTH                              0x1
#define _AADCON3_ADDSEN_MASK                                0x1
#define _AADCON3_ADIPEN_POSN                                0x1
#define _AADCON3_ADIPEN_POSITION                            0x1
#define _AADCON3_ADIPEN_SIZE                                0x1
#define _AADCON3_ADIPEN_LENGTH                              0x1
#define _AADCON3_ADIPEN_MASK                                0x2
#define _AADCON3_ADOOEN_POSN                                0x3
#define _AADCON3_ADOOEN_POSITION                            0x3
#define _AADCON3_ADOOEN_SIZE                                0x1
#define _AADCON3_ADOOEN_LENGTH                              0x1
#define _AADCON3_ADOOEN_MASK                                0x8
#define _AADCON3_ADOEN_POSN                                 0x4
#define _AADCON3_ADOEN_POSITION                             0x4
#define _AADCON3_ADOEN_SIZE                                 0x1
#define _AADCON3_ADOEN_LENGTH                               0x1
#define _AADCON3_ADOEN_MASK                                 0x10
#define _AADCON3_ADOLEN_POSN                                0x5
#define _AADCON3_ADOLEN_POSITION                            0x5
#define _AADCON3_ADOLEN_SIZE                                0x1
#define _AADCON3_ADOLEN_LENGTH                              0x1
#define _AADCON3_ADOLEN_MASK                                0x20
#define _AADCON3_ADIPPOL_POSN                               0x6
#define _AADCON3_ADIPPOL_POSITION                           0x6
#define _AADCON3_ADIPPOL_SIZE                               0x1
#define _AADCON3_ADIPPOL_LENGTH                             0x1
#define _AADCON3_ADIPPOL_MASK                               0x40
#define _AADCON3_ADEPPOL_POSN                               0x7
#define _AADCON3_ADEPPOL_POSITION                           0x7
#define _AADCON3_ADEPPOL_SIZE                               0x1
#define _AADCON3_ADEPPOL_LENGTH                             0x1
#define _AADCON3_ADEPPOL_MASK                               0x80

// Register: AADSTAT
#define AADSTAT AADSTAT
extern volatile unsigned char           AADSTAT             __at(0x715);
#ifndef _LIB_BUILD
asm("AADSTAT equ 0715h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADSTG0                 :1;
        unsigned ADSTG1                 :1;
        unsigned ADCONV                 :1;
    };
    struct {
        unsigned ADSTG                  :2;
    };
} AADSTATbits_t;
extern volatile AADSTATbits_t AADSTATbits __at(0x715);
// bitfield macros
#define _AADSTAT_ADSTG0_POSN                                0x0
#define _AADSTAT_ADSTG0_POSITION                            0x0
#define _AADSTAT_ADSTG0_SIZE                                0x1
#define _AADSTAT_ADSTG0_LENGTH                              0x1
#define _AADSTAT_ADSTG0_MASK                                0x1
#define _AADSTAT_ADSTG1_POSN                                0x1
#define _AADSTAT_ADSTG1_POSITION                            0x1
#define _AADSTAT_ADSTG1_SIZE                                0x1
#define _AADSTAT_ADSTG1_LENGTH                              0x1
#define _AADSTAT_ADSTG1_MASK                                0x2
#define _AADSTAT_ADCONV_POSN                                0x2
#define _AADSTAT_ADCONV_POSITION                            0x2
#define _AADSTAT_ADCONV_SIZE                                0x1
#define _AADSTAT_ADCONV_LENGTH                              0x1
#define _AADSTAT_ADCONV_MASK                                0x4
#define _AADSTAT_ADSTG_POSN                                 0x0
#define _AADSTAT_ADSTG_POSITION                             0x0
#define _AADSTAT_ADSTG_SIZE                                 0x2
#define _AADSTAT_ADSTG_LENGTH                               0x2
#define _AADSTAT_ADSTG_MASK                                 0x3

// Register: AADPRE
#define AADPRE AADPRE
extern volatile unsigned char           AADPRE              __at(0x716);
#ifndef _LIB_BUILD
asm("AADPRE equ 0716h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADPRE0                 :1;
        unsigned ADPRE1                 :1;
        unsigned ADPRE2                 :1;
        unsigned ADPRE3                 :1;
        unsigned ADPRE4                 :1;
        unsigned ADPRE5                 :1;
        unsigned ADPRE6                 :1;
    };
    struct {
        unsigned ADPRE                  :7;
    };
} AADPREbits_t;
extern volatile AADPREbits_t AADPREbits __at(0x716);
// bitfield macros
#define _AADPRE_ADPRE0_POSN                                 0x0
#define _AADPRE_ADPRE0_POSITION                             0x0
#define _AADPRE_ADPRE0_SIZE                                 0x1
#define _AADPRE_ADPRE0_LENGTH                               0x1
#define _AADPRE_ADPRE0_MASK                                 0x1
#define _AADPRE_ADPRE1_POSN                                 0x1
#define _AADPRE_ADPRE1_POSITION                             0x1
#define _AADPRE_ADPRE1_SIZE                                 0x1
#define _AADPRE_ADPRE1_LENGTH                               0x1
#define _AADPRE_ADPRE1_MASK                                 0x2
#define _AADPRE_ADPRE2_POSN                                 0x2
#define _AADPRE_ADPRE2_POSITION                             0x2
#define _AADPRE_ADPRE2_SIZE                                 0x1
#define _AADPRE_ADPRE2_LENGTH                               0x1
#define _AADPRE_ADPRE2_MASK                                 0x4
#define _AADPRE_ADPRE3_POSN                                 0x3
#define _AADPRE_ADPRE3_POSITION                             0x3
#define _AADPRE_ADPRE3_SIZE                                 0x1
#define _AADPRE_ADPRE3_LENGTH                               0x1
#define _AADPRE_ADPRE3_MASK                                 0x8
#define _AADPRE_ADPRE4_POSN                                 0x4
#define _AADPRE_ADPRE4_POSITION                             0x4
#define _AADPRE_ADPRE4_SIZE                                 0x1
#define _AADPRE_ADPRE4_LENGTH                               0x1
#define _AADPRE_ADPRE4_MASK                                 0x10
#define _AADPRE_ADPRE5_POSN                                 0x5
#define _AADPRE_ADPRE5_POSITION                             0x5
#define _AADPRE_ADPRE5_SIZE                                 0x1
#define _AADPRE_ADPRE5_LENGTH                               0x1
#define _AADPRE_ADPRE5_MASK                                 0x20
#define _AADPRE_ADPRE6_POSN                                 0x6
#define _AADPRE_ADPRE6_POSITION                             0x6
#define _AADPRE_ADPRE6_SIZE                                 0x1
#define _AADPRE_ADPRE6_LENGTH                               0x1
#define _AADPRE_ADPRE6_MASK                                 0x40
#define _AADPRE_ADPRE_POSN                                  0x0
#define _AADPRE_ADPRE_POSITION                              0x0
#define _AADPRE_ADPRE_SIZE                                  0x7
#define _AADPRE_ADPRE_LENGTH                                0x7
#define _AADPRE_ADPRE_MASK                                  0x7F

// Register: AADACQ
#define AADACQ AADACQ
extern volatile unsigned char           AADACQ              __at(0x717);
#ifndef _LIB_BUILD
asm("AADACQ equ 0717h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADACQ0                 :1;
        unsigned ADACQ1                 :1;
        unsigned ADACQ2                 :1;
        unsigned ADACQ3                 :1;
        unsigned ADACQ4                 :1;
        unsigned ADACQ5                 :1;
        unsigned ADACQ6                 :1;
    };
    struct {
        unsigned ADACQ                  :7;
    };
} AADACQbits_t;
