MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1513/mcu.h
extern volatile AADACQbits_t AADACQbits __at(0x717);
// bitfield macros
#define _AADACQ_ADACQ0_POSN                                 0x0
#define _AADACQ_ADACQ0_POSITION                             0x0
#define _AADACQ_ADACQ0_SIZE                                 0x1
#define _AADACQ_ADACQ0_LENGTH                               0x1
#define _AADACQ_ADACQ0_MASK                                 0x1
#define _AADACQ_ADACQ1_POSN                                 0x1
#define _AADACQ_ADACQ1_POSITION                             0x1
#define _AADACQ_ADACQ1_SIZE                                 0x1
#define _AADACQ_ADACQ1_LENGTH                               0x1
#define _AADACQ_ADACQ1_MASK                                 0x2
#define _AADACQ_ADACQ2_POSN                                 0x2
#define _AADACQ_ADACQ2_POSITION                             0x2
#define _AADACQ_ADACQ2_SIZE                                 0x1
#define _AADACQ_ADACQ2_LENGTH                               0x1
#define _AADACQ_ADACQ2_MASK                                 0x4
#define _AADACQ_ADACQ3_POSN                                 0x3
#define _AADACQ_ADACQ3_POSITION                             0x3
#define _AADACQ_ADACQ3_SIZE                                 0x1
#define _AADACQ_ADACQ3_LENGTH                               0x1
#define _AADACQ_ADACQ3_MASK                                 0x8
#define _AADACQ_ADACQ4_POSN                                 0x4
#define _AADACQ_ADACQ4_POSITION                             0x4
#define _AADACQ_ADACQ4_SIZE                                 0x1
#define _AADACQ_ADACQ4_LENGTH                               0x1
#define _AADACQ_ADACQ4_MASK                                 0x10
#define _AADACQ_ADACQ5_POSN                                 0x5
#define _AADACQ_ADACQ5_POSITION                             0x5
#define _AADACQ_ADACQ5_SIZE                                 0x1
#define _AADACQ_ADACQ5_LENGTH                               0x1
#define _AADACQ_ADACQ5_MASK                                 0x20
#define _AADACQ_ADACQ6_POSN                                 0x6
#define _AADACQ_ADACQ6_POSITION                             0x6
#define _AADACQ_ADACQ6_SIZE                                 0x1
#define _AADACQ_ADACQ6_LENGTH                               0x1
#define _AADACQ_ADACQ6_MASK                                 0x40
#define _AADACQ_ADACQ_POSN                                  0x0
#define _AADACQ_ADACQ_POSITION                              0x0
#define _AADACQ_ADACQ_SIZE                                  0x7
#define _AADACQ_ADACQ_LENGTH                                0x7
#define _AADACQ_ADACQ_MASK                                  0x7F

// Register: AADGRD
#define AADGRD AADGRD
extern volatile unsigned char           AADGRD              __at(0x718);
#ifndef _LIB_BUILD
asm("AADGRD equ 0718h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :5;
        unsigned GRDPOL                 :1;
        unsigned GRDAOE                 :1;
        unsigned GRDBOE                 :1;
    };
} AADGRDbits_t;
extern volatile AADGRDbits_t AADGRDbits __at(0x718);
// bitfield macros
#define _AADGRD_GRDPOL_POSN                                 0x5
#define _AADGRD_GRDPOL_POSITION                             0x5
#define _AADGRD_GRDPOL_SIZE                                 0x1
#define _AADGRD_GRDPOL_LENGTH                               0x1
#define _AADGRD_GRDPOL_MASK                                 0x20
#define _AADGRD_GRDAOE_POSN                                 0x6
#define _AADGRD_GRDAOE_POSITION                             0x6
#define _AADGRD_GRDAOE_SIZE                                 0x1
#define _AADGRD_GRDAOE_LENGTH                               0x1
#define _AADGRD_GRDAOE_MASK                                 0x40
#define _AADGRD_GRDBOE_POSN                                 0x7
#define _AADGRD_GRDBOE_POSITION                             0x7
#define _AADGRD_GRDBOE_SIZE                                 0x1
#define _AADGRD_GRDBOE_LENGTH                               0x1
#define _AADGRD_GRDBOE_MASK                                 0x80

// Register: AADCAP
#define AADCAP AADCAP
extern volatile unsigned char           AADCAP              __at(0x719);
#ifndef _LIB_BUILD
asm("AADCAP equ 0719h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADDCAP0                :1;
        unsigned ADDCAP1                :1;
        unsigned ADDCAP2                :1;
    };
    struct {
        unsigned ADDCAP                 :3;
    };
} AADCAPbits_t;
extern volatile AADCAPbits_t AADCAPbits __at(0x719);
// bitfield macros
#define _AADCAP_ADDCAP0_POSN                                0x0
#define _AADCAP_ADDCAP0_POSITION                            0x0
#define _AADCAP_ADDCAP0_SIZE                                0x1
#define _AADCAP_ADDCAP0_LENGTH                              0x1
#define _AADCAP_ADDCAP0_MASK                                0x1
#define _AADCAP_ADDCAP1_POSN                                0x1
#define _AADCAP_ADDCAP1_POSITION                            0x1
#define _AADCAP_ADDCAP1_SIZE                                0x1
#define _AADCAP_ADDCAP1_LENGTH                              0x1
#define _AADCAP_ADDCAP1_MASK                                0x2
#define _AADCAP_ADDCAP2_POSN                                0x2
#define _AADCAP_ADDCAP2_POSITION                            0x2
#define _AADCAP_ADDCAP2_SIZE                                0x1
#define _AADCAP_ADDCAP2_LENGTH                              0x1
#define _AADCAP_ADDCAP2_MASK                                0x4
#define _AADCAP_ADDCAP_POSN                                 0x0
#define _AADCAP_ADDCAP_POSITION                             0x0
#define _AADCAP_ADDCAP_SIZE                                 0x3
#define _AADCAP_ADDCAP_LENGTH                               0x3
#define _AADCAP_ADDCAP_MASK                                 0x7

// Register: AADRES0
#define AADRES0 AADRES0
extern volatile unsigned short          AADRES0             __at(0x71A);
#ifndef _LIB_BUILD
asm("AADRES0 equ 071Ah");
#endif
// aliases
extern volatile unsigned short          AD1RES0             __at(0x71A);
#ifndef _LIB_BUILD
asm("AD1RES0 equ 071Ah");
#endif

// Register: AADRES0L
#define AADRES0L AADRES0L
extern volatile unsigned char           AADRES0L            __at(0x71A);
#ifndef _LIB_BUILD
asm("AADRES0L equ 071Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADRES0L                :8;
    };
} AADRES0Lbits_t;
extern volatile AADRES0Lbits_t AADRES0Lbits __at(0x71A);
// bitfield macros
#define _AADRES0L_ADRES0L_POSN                              0x0
#define _AADRES0L_ADRES0L_POSITION                          0x0
#define _AADRES0L_ADRES0L_SIZE                              0x8
#define _AADRES0L_ADRES0L_LENGTH                            0x8
#define _AADRES0L_ADRES0L_MASK                              0xFF

