MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1513/mcu.h
// Register: AADRES0H
#define AADRES0H AADRES0H
extern volatile unsigned char           AADRES0H            __at(0x71B);
#ifndef _LIB_BUILD
asm("AADRES0H equ 071Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADRES0H                :8;
    };
} AADRES0Hbits_t;
extern volatile AADRES0Hbits_t AADRES0Hbits __at(0x71B);
// bitfield macros
#define _AADRES0H_ADRES0H_POSN                              0x0
#define _AADRES0H_ADRES0H_POSITION                          0x0
#define _AADRES0H_ADRES0H_SIZE                              0x8
#define _AADRES0H_ADRES0H_LENGTH                            0x8
#define _AADRES0H_ADRES0H_MASK                              0xFF

// Register: AADRES1
#define AADRES1 AADRES1
extern volatile unsigned short          AADRES1             __at(0x71C);
#ifndef _LIB_BUILD
asm("AADRES1 equ 071Ch");
#endif
// aliases
extern volatile unsigned short          AD1RES1             __at(0x71C);
#ifndef _LIB_BUILD
asm("AD1RES1 equ 071Ch");
#endif

// Register: AADRES1L
#define AADRES1L AADRES1L
extern volatile unsigned char           AADRES1L            __at(0x71C);
#ifndef _LIB_BUILD
asm("AADRES1L equ 071Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADRES1L                :8;
    };
} AADRES1Lbits_t;
extern volatile AADRES1Lbits_t AADRES1Lbits __at(0x71C);
// bitfield macros
#define _AADRES1L_ADRES1L_POSN                              0x0
#define _AADRES1L_ADRES1L_POSITION                          0x0
#define _AADRES1L_ADRES1L_SIZE                              0x8
#define _AADRES1L_ADRES1L_LENGTH                            0x8
#define _AADRES1L_ADRES1L_MASK                              0xFF

// Register: AADRES1H
#define AADRES1H AADRES1H
extern volatile unsigned char           AADRES1H            __at(0x71D);
#ifndef _LIB_BUILD
asm("AADRES1H equ 071Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADRES1H                :8;
    };
} AADRES1Hbits_t;
extern volatile AADRES1Hbits_t AADRES1Hbits __at(0x71D);
// bitfield macros
#define _AADRES1H_ADRES1H_POSN                              0x0
#define _AADRES1H_ADRES1H_POSITION                          0x0
#define _AADRES1H_ADRES1H_SIZE                              0x8
#define _AADRES1H_ADRES1H_LENGTH                            0x8
#define _AADRES1H_ADRES1H_MASK                              0xFF

// Register: STATUS_SHAD
#define STATUS_SHAD STATUS_SHAD
extern volatile unsigned char           STATUS_SHAD         __at(0xFE4);
#ifndef _LIB_BUILD
asm("STATUS_SHAD equ 0FE4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned C_SHAD                 :1;
        unsigned DC_SHAD                :1;
        unsigned Z_SHAD                 :1;
    };
} STATUS_SHADbits_t;
extern volatile STATUS_SHADbits_t STATUS_SHADbits __at(0xFE4);
// bitfield macros
#define _STATUS_SHAD_C_SHAD_POSN                            0x0
#define _STATUS_SHAD_C_SHAD_POSITION                        0x0
#define _STATUS_SHAD_C_SHAD_SIZE                            0x1
#define _STATUS_SHAD_C_SHAD_LENGTH                          0x1
#define _STATUS_SHAD_C_SHAD_MASK                            0x1
#define _STATUS_SHAD_DC_SHAD_POSN                           0x1
#define _STATUS_SHAD_DC_SHAD_POSITION                       0x1
#define _STATUS_SHAD_DC_SHAD_SIZE                           0x1
#define _STATUS_SHAD_DC_SHAD_LENGTH                         0x1
#define _STATUS_SHAD_DC_SHAD_MASK                           0x2
#define _STATUS_SHAD_Z_SHAD_POSN                            0x2
#define _STATUS_SHAD_Z_SHAD_POSITION                        0x2
#define _STATUS_SHAD_Z_SHAD_SIZE                            0x1
#define _STATUS_SHAD_Z_SHAD_LENGTH                          0x1
#define _STATUS_SHAD_Z_SHAD_MASK                            0x4

// Register: WREG_SHAD
#define WREG_SHAD WREG_SHAD
extern volatile unsigned char           WREG_SHAD           __at(0xFE5);
#ifndef _LIB_BUILD
asm("WREG_SHAD equ 0FE5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned WREG_SHAD              :8;
    };
} WREG_SHADbits_t;
extern volatile WREG_SHADbits_t WREG_SHADbits __at(0xFE5);
// bitfield macros
#define _WREG_SHAD_WREG_SHAD_POSN                           0x0
#define _WREG_SHAD_WREG_SHAD_POSITION                       0x0
#define _WREG_SHAD_WREG_SHAD_SIZE                           0x8
#define _WREG_SHAD_WREG_SHAD_LENGTH                         0x8
#define _WREG_SHAD_WREG_SHAD_MASK                           0xFF

// Register: BSR_SHAD
#define BSR_SHAD BSR_SHAD
extern volatile unsigned char           BSR_SHAD            __at(0xFE6);
#ifndef _LIB_BUILD
asm("BSR_SHAD equ 0FE6h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BSR_SHAD               :5;
    };
} BSR_SHADbits_t;
extern volatile BSR_SHADbits_t BSR_SHADbits __at(0xFE6);
// bitfield macros
#define _BSR_SHAD_BSR_SHAD_POSN                             0x0
#define _BSR_SHAD_BSR_SHAD_POSITION                         0x0
#define _BSR_SHAD_BSR_SHAD_SIZE                             0x5
#define _BSR_SHAD_BSR_SHAD_LENGTH                           0x5
#define _BSR_SHAD_BSR_SHAD_MASK                             0x1F

// Register: PCLATH_SHAD
#define PCLATH_SHAD PCLATH_SHAD
extern volatile unsigned char           PCLATH_SHAD         __at(0xFE7);
#ifndef _LIB_BUILD
asm("PCLATH_SHAD equ 0FE7h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PCLATH_SHAD            :7;
    };
} PCLATH_SHADbits_t;
extern volatile PCLATH_SHADbits_t PCLATH_SHADbits __at(0xFE7);
// bitfield macros
#define _PCLATH_SHAD_PCLATH_SHAD_POSN                       0x0
#define _PCLATH_SHAD_PCLATH_SHAD_POSITION                   0x0
#define _PCLATH_SHAD_PCLATH_SHAD_SIZE                       0x7
#define _PCLATH_SHAD_PCLATH_SHAD_LENGTH                     0x7
#define _PCLATH_SHAD_PCLATH_SHAD_MASK                       0x7F

// Register: FSR0L_SHAD
#define FSR0L_SHAD FSR0L_SHAD
extern volatile unsigned char           FSR0L_SHAD          __at(0xFE8);
#ifndef _LIB_BUILD
asm("FSR0L_SHAD equ 0FE8h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FSR0L_SHAD             :8;
    };
} FSR0L_SHADbits_t;
extern volatile FSR0L_SHADbits_t FSR0L_SHADbits __at(0xFE8);
// bitfield macros
#define _FSR0L_SHAD_FSR0L_SHAD_POSN                         0x0
#define _FSR0L_SHAD_FSR0L_SHAD_POSITION                     0x0
#define _FSR0L_SHAD_FSR0L_SHAD_SIZE                         0x8
#define _FSR0L_SHAD_FSR0L_SHAD_LENGTH                       0x8
#define _FSR0L_SHAD_FSR0L_SHAD_MASK                         0xFF

// Register: FSR0H_SHAD
#define FSR0H_SHAD FSR0H_SHAD
extern volatile unsigned char           FSR0H_SHAD          __at(0xFE9);
#ifndef _LIB_BUILD
asm("FSR0H_SHAD equ 0FE9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FSR0H_SHAD             :8;
    };
} FSR0H_SHADbits_t;
